Programming/Cpp_Cookbook.org
#+TITLE: Cpp_Cookbook
#+AUTHOR: DarkSun
#+OPTIONS: ^:{}

* 代码结构
** 使用向前类声明来减少#include的使用

   当不关心引用类的细节时,可以使用向前类声明的方式来减少编译依赖.

   所谓不关心类A的细节,意味着不能使用类A的成员变量和方法,类A不能声明为其他类的成员变量,因为需要知道A的大小.

   但由于指针和引用具有固定大小,因此可以使用
** 命名空间
   * 命名空间可以嵌套
   * 命名空间别名
	 #+BEGIN_SRC c++
       using 别名 = 全称;
       别名::类 对象;
	 #+END_SRC
   * 命名空间中的自动查找功能

	 当你传入一个属于某个命名空间的函数参数时,在这个函数体内部执行这个函数的名字查找功能时,编译器会包含这个命名空间
	 #+BEGIN_SRC c++
       void f(dev::Device& d){
               register(d);            // 这里的register实际可能是dev::register
       }
	 #+END_SRC
* 数值计算
** 字符串转换成数值
   还在使用C库中的atof和atoi吗?快来试试<cstdlib>中的strtol,strtod和strtoul吧,它们分别可以转换为long int,double,和unsigned long型,而且支持任意进制的字符串.

   这些函数还有对应的款字符函数,分别是wstrtol,wstrtod和wstrtoul

   也可以使用stringstream的operator>>方法来实现类型的转换,使用这种方法甚至能够解析含有科学计数法表示的数值
** 获取某种数值类型的最大和最小值
   使用<limits>中的numeric_limits类模板中的max()/min()方法就可以知道某个数值类型所能表示的最大和最小值
* 字符串操作
** 如何反转字符串
   字符串可以看成是字符的容器,还记得<algorithm>中的reverse函数模板么?那么,答案就是:
   #+BEGIN_SRC c++
     std::reverse(s.begin(),s.end());
   #+END_SRC
   
   若要翻转的复制一个字符串,则可以使用翻转迭代器
   #+BEGIN_SRC c++
     std::string rs;
     rs.assign(s.rbegin(),s.rend());
   #+END_SRC
** 从字符串中删除子字符串
   使用find查找到子字符串的位置,在用erase函数删除
** 大小写不敏感的字符串比较
   使用equal模板函数来比较两个字符串,并提供自己的字符比较函数,在字符的比较函数中使用toupper函数/tolower函数(<cctype>)

   但光这样做还不行,还需要比较它们的长度. 因为equal函数只比较前n个元素.
** 如何在忽略大小写的情况下从一个字符串中查找一个子串
   使用search算法+toupper函数就能实现.
   #+BEGIN_SRC c++
     bool caseIngoreCharComp(char a,char b)
     {
         return (toupper(a) == toupper(b));
     }
     
     string::size_type caseIgnoreFind(const string& s,const string& p)
     {
         string::const_iterator pos = search(s.begin(),s.end(),p.begin(),p.end(),caseIngoreCharComp);
         if(pos == s.end())
         {
             return string::npos;
         }
         return pos - s.begin();
     }
     
   #+END_SRC
** 字符测试函数
   在<cctype>中定义了大量的字符测试函数
   | 单字符版函数 | 宽字符版函数 | 说明         |
   |--------------+--------------+--------------|
   | isalpha      | iswalpha     | 希腊字母     |
   | isupper      | iswupper     | 大写希腊字母 |
   | islower      | iswlower     | 小些希腊字母 |
   | isdigit      | iswdigit     | 数字         |
   | isxdigit     | iswxdigit    | 十六进制数字 |
   | isspace      | iswspace     | 空白符       |
   | iscntrl      | iswcntrl     | 控制符       |
   | ispunct      | iswpunct     | 不属于以上各组的标点符号 |
   | isalnum      | iswalnum     | 希腊字符或数字           |
   | isprint      | iswprint     | 可打印的ASCII字符        |
   | isgraph      | iswgraph     | 希腊字符或数字或标点符号 |
   |              |              |                          |
** getline函数
   <string>中提供了getline函数模板,使用它能够一次读取一行文本到某个string变量中,或者更精确的,可以把文本读取直到碰到一个特定的定界符.
   #+BEGIN_SRC c++
     basic_istream<char>& getline(basic_istream<char> cin,basic_string<char>& str,char _delim='\n');
   #+END_SRC

   <basic_istream>中有个同名的函数,但它把输出存在一个字符缓存中而不是字符串中.
** 如何使你的文本右对齐或左对齐
   最简单的方法就是使用流和标准流中的格式标志右和左. 
   #+BEGIN_SRC c++
     ofstream out(file);
     ios_base::fmtflags flgs = out.setf(ios_base::right); // 当用完设置的格式标志时,你应该做的就是清掉它们.
     out.width(72);
     out<<line<<endl;                
     out.flags(flgs);                // 还原原格式,flags函数和setf的不同在于flags是替代原标志,而setf是打开某个标志
   #+END_SRC
** 如何把文件中连续的多个空格缩减为1个.
   最简单的方法就是使用<string>中的操作符>>函数模板,从一个流中把一块连续的非空白字符读入到一个字符串中,然后使用"<<"操作符,把文本写入到输出流中,并在每块的末尾追加一个空格.
   #+BEGIN_SRC c++
     ifstream ifs;
     ofstream ofs;
     
     string tmp;
     ifs >> tmp;
     ofs << tmp;
     while(ifs >> tmp)
     {
             ofs<<' '<<tmp;
     }
   #+END_SRC
* 日期与时间
** localtime，gmtime和asctime函数都返回一个指向静态分配的对象的指针
   这意味着随后的调用将改变这些对象的值，且这些函数不能用在多线程环境中。

   #+BEGIN_SRC c++
     char* x = asctime(localtime(time(NULL)));
     sleep(15);
     sactime(localtime(time(NULL)));
     cout<<x<<endl;                  // 这里显示的是当前的时间而不是15s之前的时间
   #+END_SRC

   若要将这些函数用在多线程的环境下，则需要使用localtime_r,gmtime_r,asctime_r来代替。
