Programming/Cpp_Cookbook.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Cpp<sub>Cookbook</sub></title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="Cpp<sub>Cookbook</sub>"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2014-07-22T16:17+0800"/>
<meta name="author" content="DarkSun"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>



</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Cpp<sub>Cookbook</sub></h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 代码结构</a>
<ul>
<li><a href="#sec-1-1">1.1 使用向前类声明来减少#include的使用</a></li>
<li><a href="#sec-1-2">1.2 命名空间</a></li>
</ul>
</li>
<li><a href="#sec-2">2 数值计算</a>
<ul>
<li><a href="#sec-2-1">2.1 字符串转换成数值</a></li>
<li><a href="#sec-2-2">2.2 获取某种数值类型的最大和最小值</a></li>
</ul>
</li>
<li><a href="#sec-3">3 字符串操作</a>
<ul>
<li><a href="#sec-3-1">3.1 如何反转字符串</a></li>
<li><a href="#sec-3-2">3.2 从字符串中删除子字符串</a></li>
<li><a href="#sec-3-3">3.3 大小写不敏感的字符串比较</a></li>
<li><a href="#sec-3-4">3.4 如何在忽略大小写的情况下从一个字符串中查找一个子串</a></li>
<li><a href="#sec-3-5">3.5 字符测试函数</a></li>
<li><a href="#sec-3-6">3.6 getline函数</a></li>
<li><a href="#sec-3-7">3.7 如何使你的文本右对齐或左对齐</a></li>
<li><a href="#sec-3-8">3.8 如何把文件中连续的多个空格缩减为1个.</a></li>
</ul>
</li>
<li><a href="#sec-4">4 日期与时间</a>
<ul>
<li><a href="#sec-4-1">4.1 localtime，gmtime和asctime函数都返回一个指向静态分配的对象的指针</a></li>
<li><a href="#sec-4-2">4.2 如何将日期/时间格式化为一个字符串</a></li>
</ul>
</li>
<li><a href="#sec-5">5 容器</a>
<ul>
<li><a href="#sec-5-1">5.1 如何使用一个由逗号分割开的数列来初始化一个容器</a></li>
</ul>
</li>
<li><a href="#sec-6">6 算法</a>
<ul>
<li><a href="#sec-6-1">6.1 如何随机打乱数据</a></li>
<li><a href="#sec-6-2">6.2 如何在序列上进行集合运算</a></li>
<li><a href="#sec-6-3">6.3 如何将一个范围的元素输出到数据流中</a></li>
<li><a href="#sec-6-4">6.4 如何快速读取一系列数据存入容器中</a></li>
</ul>
</li>
<li><a href="#sec-7">7 类</a>
<ul>
<li><a href="#sec-7-1">7.1 类成员变量,需要在独立的源文件中初始化它,而不是在它所声明的头文件中.</a></li>
<li><a href="#sec-7-2">7.2 若在基类中提供了虚的析构函数,则你需要给它一个实现,这是因为子类的析构函数需要自动调用基类的析构函数</a></li>
<li><a href="#sec-7-3">7.3 如何调用超类中的虚函数</a></li>
</ul>
</li>
<li><a href="#sec-8">8 异常安全</a>
<ul>
<li><a href="#sec-8-1">8.1 保证初始化列表的异常安全</a></li>
<li><a href="#sec-8-2">8.2 如何使类具有强异常安全保证</a></li>
</ul>
</li>
<li><a href="#sec-9">9 流</a>
<ul>
<li><a href="#sec-9-1">9.1 如何实现自己的流操作符</a></li>
<li><a href="#sec-9-2">9.2 如何删除/重命名文件</a></li>
<li><a href="#sec-9-3">9.3 如何创建一个临时文件名和文件</a></li>
</ul>
</li>
<li><a href="#sec-10">10 数字</a>
<ul>
<li><a href="#sec-10-1">10.1 查找最大/最小值</a></li>
<li><a href="#sec-10-2">10.2 计算总和与平均值</a></li>
<li><a href="#sec-10-3">10.3 过滤掉给定范围之外的值</a></li>
<li><a href="#sec-10-4">10.4 生成随机数</a></li>
</ul>
</li>
<li><a href="#sec-11">11 国际化问题</a>
<ul>
<li><a href="#sec-11-1">11.1 硬编码Unicode字符串</a></li>
<li><a href="#sec-11-2">11.2 如何以遵循本地格式的方法读取/写入一个数字到流</a></li>
<li><a href="#sec-11-3">11.3 如何用本地的格式习惯来显示/读取时间和日期</a></li>
<li><a href="#sec-11-4">11.4 如何读取/写入符合本地格式的货币值</a></li>
<li><a href="#sec-11-5">11.5 如何对本地化字符串进行排序</a></li>
</ul>
</li>
<li><a href="#sec-12">12 指针</a>
<ul>
<li><a href="#sec-12-1">12.1 如何引用数据成员或成员函数的地址</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 代码结构</h2>
<div class="outline-text-2" id="text-1">


</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> 使用向前类声明来减少#include的使用</h3>
<div class="outline-text-3" id="text-1-1">


<p>
   当不关心引用类的细节时,可以使用向前类声明的方式来减少编译依赖.
</p>
<p>
   所谓不关心类A的细节,意味着不能使用类A的成员变量和方法,类A不能声明为其他类的成员变量,因为需要知道A的大小.
</p>
<p>
   但由于指针和引用具有固定大小,因此可以使用
</p></div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> 命名空间</h3>
<div class="outline-text-3" id="text-1-2">

<ul>
<li>命名空间可以嵌套
</li>
<li>命名空间别名



<pre class="example">using 别名 = 全称;
别名::类 对象;
</pre>

</li>
<li>命名空间中的自动查找功能

<p>
     当你传入一个属于某个命名空间的函数参数时,在这个函数体内部执行这个函数的名字查找功能时,编译器会包含这个命名空间
</p>


<pre class="example">void f(dev::Device&amp; d){
        register(d);            // 这里的register实际可能是dev::register
}
</pre>

</li>
</ul>

</div>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 数值计算</h2>
<div class="outline-text-2" id="text-2">


</div>

<div id="outline-container-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> 字符串转换成数值</h3>
<div class="outline-text-3" id="text-2-1">

<p>   还在使用C库中的atof和atoi吗?快来试试&lt;cstdlib&gt;中的strtol,strtod和strtoul吧,它们分别可以转换为long int,double,和unsigned long型,而且支持任意进制的字符串.
</p>
<p>
   这些函数还有对应的款字符函数,分别是wstrtol,wstrtod和wstrtoul
</p>
<p>
   也可以使用stringstream的operator&gt;&gt;方法来实现类型的转换,使用这种方法甚至能够解析含有科学计数法表示的数值
</p></div>

</div>

<div id="outline-container-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> 获取某种数值类型的最大和最小值</h3>
<div class="outline-text-3" id="text-2-2">

<p>   使用&lt;limits&gt;中的numeric_limits类模板中的max()/min()方法就可以知道某个数值类型所能表示的最大和最小值
</p></div>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> 字符串操作</h2>
<div class="outline-text-2" id="text-3">


</div>

<div id="outline-container-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> 如何反转字符串</h3>
<div class="outline-text-3" id="text-3-1">

<p>   字符串可以看成是字符的容器,还记得&lt;algorithm&gt;中的reverse函数模板么?那么,答案就是:
</p>


<pre class="example">std::reverse(s.begin(),s.end());
</pre>


<p>   
   若要翻转的复制一个字符串,则可以使用翻转迭代器
</p>


<pre class="example">std::string rs;
rs.assign(s.rbegin(),s.rend());
</pre>

</div>

</div>

<div id="outline-container-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> 从字符串中删除子字符串</h3>
<div class="outline-text-3" id="text-3-2">

<p>   使用find查找到子字符串的位置,在用erase函数删除
</p></div>

</div>

<div id="outline-container-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> 大小写不敏感的字符串比较</h3>
<div class="outline-text-3" id="text-3-3">

<p>   使用equal模板函数来比较两个字符串,并提供自己的字符比较函数,在字符的比较函数中使用toupper函数/tolower函数(&lt;cctype&gt;)
</p>
<p>
   但光这样做还不行,还需要比较它们的长度. 因为equal函数只比较前n个元素.
</p></div>

</div>

<div id="outline-container-3-4" class="outline-3">
<h3 id="sec-3-4"><span class="section-number-3">3.4</span> 如何在忽略大小写的情况下从一个字符串中查找一个子串</h3>
<div class="outline-text-3" id="text-3-4">

<p>   使用search算法+toupper函数就能实现.
</p>


<pre class="example">bool caseIngoreCharComp(char a,char b)
{
    return (toupper(a) == toupper(b));
}

string::size_type caseIgnoreFind(const string&amp; s,const string&amp; p)
{
    string::const_iterator pos = search(s.begin(),s.end(),p.begin(),p.end(),caseIngoreCharComp);
    if(pos == s.end())
    {
        return string::npos;
    }
    return pos - s.begin();
}

</pre>

</div>

</div>

<div id="outline-container-3-5" class="outline-3">
<h3 id="sec-3-5"><span class="section-number-3">3.5</span> 字符测试函数</h3>
<div class="outline-text-3" id="text-3-5">

<p>   在&lt;cctype&gt;中定义了大量的字符测试函数
</p><table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup><col class="left" /><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left">单字符版函数</th><th scope="col" class="left">宽字符版函数</th><th scope="col" class="left">说明</th></tr>
</thead>
<tbody>
<tr><td class="left">isalpha</td><td class="left">iswalpha</td><td class="left">希腊字母</td></tr>
<tr><td class="left">isupper</td><td class="left">iswupper</td><td class="left">大写希腊字母</td></tr>
<tr><td class="left">islower</td><td class="left">iswlower</td><td class="left">小些希腊字母</td></tr>
<tr><td class="left">isdigit</td><td class="left">iswdigit</td><td class="left">数字</td></tr>
<tr><td class="left">isxdigit</td><td class="left">iswxdigit</td><td class="left">十六进制数字</td></tr>
<tr><td class="left">isspace</td><td class="left">iswspace</td><td class="left">空白符</td></tr>
<tr><td class="left">iscntrl</td><td class="left">iswcntrl</td><td class="left">控制符</td></tr>
<tr><td class="left">ispunct</td><td class="left">iswpunct</td><td class="left">不属于以上各组的标点符号</td></tr>
<tr><td class="left">isalnum</td><td class="left">iswalnum</td><td class="left">希腊字符或数字</td></tr>
<tr><td class="left">isprint</td><td class="left">iswprint</td><td class="left">可打印的ASCII字符</td></tr>
<tr><td class="left">isgraph</td><td class="left">iswgraph</td><td class="left">希腊字符或数字或标点符号</td></tr>
</tbody>
</table>

</div>

</div>

<div id="outline-container-3-6" class="outline-3">
<h3 id="sec-3-6"><span class="section-number-3">3.6</span> getline函数</h3>
<div class="outline-text-3" id="text-3-6">

<p>   &lt;string&gt;中提供了getline函数模板,使用它能够一次读取一行文本到某个string变量中,或者更精确的,可以把文本读取直到碰到一个特定的定界符.
</p>


<pre class="example">basic_istream&lt;char&gt;&amp; getline(basic_istream&lt;char&gt; cin,basic_string&lt;char&gt;&amp; str,char _delim='\n');
</pre>


<p>
   &lt;basic_istream&gt;中有个同名的函数,但它把输出存在一个字符缓存中而不是字符串中.
</p></div>

</div>

<div id="outline-container-3-7" class="outline-3">
<h3 id="sec-3-7"><span class="section-number-3">3.7</span> 如何使你的文本右对齐或左对齐</h3>
<div class="outline-text-3" id="text-3-7">

<p>   最简单的方法就是使用流和标准流中的格式标志右和左. 
</p>


<pre class="example">ofstream out(file);
ios_base::fmtflags flgs = out.setf(ios_base::right); // 当用完设置的格式标志时,你应该做的就是清掉它们.
out.width(72);
out&lt;&lt;line&lt;&lt;endl;                
out.flags(flgs);                // 还原原格式,flags函数和setf的不同在于flags是替代原标志,而setf是打开某个标志
</pre>

</div>

</div>

<div id="outline-container-3-8" class="outline-3">
<h3 id="sec-3-8"><span class="section-number-3">3.8</span> 如何把文件中连续的多个空格缩减为1个.</h3>
<div class="outline-text-3" id="text-3-8">

<p>   最简单的方法就是使用&lt;string&gt;中的操作符&gt;&gt;函数模板,从一个流中把一块连续的非空白字符读入到一个字符串中,然后使用"&lt;&lt;"操作符,把文本写入到输出流中,并在每块的末尾追加一个空格.
</p>


<pre class="example">ifstream ifs;
ofstream ofs;

string tmp;
ifs &gt;&gt; tmp;
ofs &lt;&lt; tmp;
while(ifs &gt;&gt; tmp)
{
        ofs&lt;&lt;' '&lt;&lt;tmp;
}
</pre>

</div>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> 日期与时间</h2>
<div class="outline-text-2" id="text-4">


</div>

<div id="outline-container-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> localtime，gmtime和asctime函数都返回一个指向静态分配的对象的指针</h3>
<div class="outline-text-3" id="text-4-1">

<p>   这意味着随后的调用将改变这些对象的值，且这些函数不能用在多线程环境中。
</p>



<pre class="example">char* x = asctime(localtime(time(NULL)));
sleep(15);
sactime(localtime(time(NULL)));
cout&lt;&lt;x&lt;&lt;endl;                  // 这里显示的是当前的时间而不是15s之前的时间
</pre>


<p>
   若要将这些函数用在多线程的环境下，则需要使用localtime_r,gmtime_r,asctime_r来代替。
</p></div>

</div>
