Programming/Cpp_Cookbook.org
** 如何将日期/时间格式化为一个字符串
   除了可以使用C语言<time.h>中的strftime函数外,还可以使用<locale>中的time_put模板类.
   #+BEGIN_SRC c++
     ostream& formatDateTime(ostream& out,const tm& t, const char* fmt)
     {
             const time_put<char>& dateWriter = use_facet<time_put<char> >(out.getloc());
             int n = strlen(fmt);
             if(dateWriter.put(out,out,' ',&t,fmt,fmt+n,).failed())
             {
                     throw runtime_error("failure to format date time");
             }
             return out;
     }
   #+END_SRC
   time_put成员函数与C语言的printf函数一样使用一个字符串来指定输出的格式. 
   #+CAPTION: 日期/时间格式的指定符
   | 格式指定符 | 描述                                 |
   |------------+--------------------------------------|
   | a          | 星期的缩写(Mon)                      |
   | A          | 星期的完整名(Monday)                 |
   | b          | 月份的缩写(Dec)                      |
   | B          | 月份的完整名(May)                    |
   | c          | 完全的日期和时间                     |
   | d          | 月份中的天数(01~31)                  |
   | H          | 24小时制中的小时数(00-23)            |
   | I          | 12小时制的小时数(01-12)              |
   | j          | 一年中的天数(01~366)                 |
   | m          | 月份数(01~12)                        |
   | M          | 分钟数(00~59)                        |
   | p          | (上午/下午)的标识(AM/PM)             |
   | S          | 秒数,包括最多两个润秒                |
   | U          | 周数(00~53),第一周从第一个星期天开始 |
   | w          | 每周中的天数(0~6),星期天为0          |
   | W          | 周数(00~53),第一周从第一个星期一开始 |
   | x          | 采用MM/DD/YY格式的日期               |
   | X          | 24小时制中HH/MM/SS格式的时间         |
   | y          | 当前世纪中的年数(00-99)              |
   | Y          | 年                                   |
   | Z          | 时区的缩写,如果系统不知道时区的话,就是空           |
* STL
** 如何使用一个由逗号分割开的数列来初始化一个容器
   通过定义一个帮助类并重载逗号操作符,就可以在这些标准的容器中使用逗号初始化语法了.
   #+BEGIN_SRC c++
     template<class Seq_T>
     class comma_helper
     {
     public:
         typedef typename Seq_T::value_type value_type;
         explicit comma_helper(Seq_T& x) :m(x){
         }
         comma_helper& operator=(const value_type& x){
             m.clear();
             m.push_back(x);
             return *this;
         }
         comma_helper& operator+=(const value_type& x){
             m.push_back(x);
             return *this;
         }
         
         template<class Scalar_T>
         comma_helper& operator,(Scalar_T x){
             return operator+=(x);
         }
     private:
         Seq_T& m;
     };
     
     template<typename Seq_T>
     comma_helper<Seq_T> initialize(Seq_T& x)
     {
         return comma_helper<Seq_T>(x);
     }
     
     
     int main(int argc,char** argv)
     {
         vector<int> v;
         initialize(v) = 0,1,1,2,3,4,5;
         cout<<v[5]<<endl;
         return 0;
     }
   #+END_SRC
** 如何随机打乱数据
   使用<algorithm>中的random_shuffle标准算法带两个随机访问迭代器和一个可选的随机数产生函数,可以在一定范围内随机打乱这些数据
   
   若要使用自己的随机数产生器,则它必须接收一个简单参数并返回一个简单值,且这两个值都可以转换成iterator_traits<RndIter>::difference_type类型
** 如何在序列上进行集合运算
   使用标准类库函数:set_union,set_difference,set_intersection和set_symmetric_difference
** 如何将一个范围的元素输出到数据流中
   使用copy算法和ostream_iterator算法把每一个元素都写到一个流中去.
** 如何快速读取一系列数据存入容器中
   使用istream_iterator即可
   #+BEGIN_SRC c++
     istream_iterator<stirng> start(cin);
     istream_iterator<string> end;
     vector<string> vs(start,end)
   #+END_SRC
* 类
** 类成员变量,需要在独立的源文件中初始化它,而不是在它所声明的头文件中.
   #+BEGIN_SRC c++
     // static.h
     class OneStatic
     {
             static int count;
     };
     // static.cpp
     int OneStatic::count = 0;
   #+END_SRC
   
   若把初始化语句放到头文件,则每个包含了头文件的实现文件都会給这个变量分配存储空间,这样会得到链接错误.
** 若在基类中提供了虚的析构函数,则你需要给它一个实现,这是因为子类的析构函数需要自动调用基类的析构函数
** 如何调用超类中的虚函数
   使用目标基类来修饰你的成员函数名
   #+BEGIN_SRC c++
     DerivedPtr->Base::foo()
   #+END_SRC
* 异常安全
** 保证初始化列表的异常安全
   要捕获初始化列表中抛出的异常,需要使用try..catch的一种特殊用法
   #+BEGIN_SRC c++
     class Broker
     {
     public:
             Broker(int devno1,int devno2)
             try:dev1_(Device(devno1)),
                         dev2_(Device(devno2)){}
             catch(...)
             {
                     throw;          // 需要注意的是,这里无法访问dev1_和dev2_,因为这时候它们还不存在
             }
     }
   #+END_SRC

   这里它把try代码块当成构造函数体.
** 如何使类具有强异常安全保证
   先做可能抛出异常的操作. 这些危险操作完成后,再更新对象状态.
* 流
** 如何实现自己的流操作符
   有两类留操作符:带参数的和不带参数的.

   不带参数的流操作符容易实现. 只需要写一个以ios_base作为参数的函数. 在函数中对这个流做一些处理,然后再把这个流返回即可

   而带参数的流操作符,需要实现为一个类,该类以参数为构造函数的参数,并通过实现operator(ostream& os)方法供流对象使用.
   此外,需要定义一个函数,该函数接收参数并返回上面定义的类对象.
   最后,还需要重载操作符<<,使得流对象直到 如何处理这个对象:
   #+BEGIN_SRC c++
     class WidthSetter
     {
     public:
             WidthSetter(int n):width_(n){}
             void operator(osteram& os) const {
                     os.width(width_);
             }
     private:
             int width_;
     };
             
     
     WidthSetter setWidth(int n){
             return WidthSetter(n);
     }
     
     ostream& operator<<(ostream& os, const WidthSetter& ws){
             ws(os);
             return os;
     }
   #+END_SRC
** 如何删除/重命名文件
   定义在<cstdio>中的标准C函数remove和rename可以完成这个任务
** 如何创建一个临时文件名和文件
   使用<cstdio>中的tmpfile或tmpname函数
* 数字
** 查找最大/最小值
   使用<algorithm>中的函数max_element和min_element
** 计算总和与平均值
   使用<numeric>中的accumulate函数来计算总和,用distance函数来计算个数

   但该方法不能与istream_iterator一起工作
** 过滤掉给定范围之外的值
   使用定义在<algorithm>中的remove_copy_if函数
** 生成随机数
   <cstdlib>提供了一个C的运行函数rand来产生0到RAND_MAX之间的随机数

   使用rand函数前,还需要调用srand来給随机数产生器产生一个种子
* 国际化问题
