Programming/Cpp_Cookbook.html

<div id="outline-container-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> 如何将日期/时间格式化为一个字符串</h3>
<div class="outline-text-3" id="text-4-2">

<p>   除了可以使用C语言&lt;time.h&gt;中的strftime函数外,还可以使用&lt;locale&gt;中的time_put模板类.
</p>


<pre class="example">ostream&amp; formatDateTime(ostream&amp; out,const tm&amp; t, const char* fmt)
{
        const time_put&lt;char&gt;&amp; dateWriter = use_facet&lt;time_put&lt;char&gt; &gt;(out.getloc());
        int n = strlen(fmt);
        if(dateWriter.put(out,out,' ',&amp;t,fmt,fmt+n,).failed())
        {
                throw runtime_error("failure to format date time");
        }
        return out;
}
</pre>

<p>
   time_put成员函数与C语言的printf函数一样使用一个字符串来指定输出的格式. 
</p><table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption>日期/时间格式的指定符</caption>
<colgroup><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left">格式指定符</th><th scope="col" class="left">描述</th></tr>
</thead>
<tbody>
<tr><td class="left">a</td><td class="left">星期的缩写(Mon)</td></tr>
<tr><td class="left">A</td><td class="left">星期的完整名(Monday)</td></tr>
<tr><td class="left">b</td><td class="left">月份的缩写(Dec)</td></tr>
<tr><td class="left">B</td><td class="left">月份的完整名(May)</td></tr>
<tr><td class="left">c</td><td class="left">完全的日期和时间</td></tr>
<tr><td class="left">d</td><td class="left">月份中的天数(01~31)</td></tr>
<tr><td class="left">H</td><td class="left">24小时制中的小时数(00-23)</td></tr>
<tr><td class="left">I</td><td class="left">12小时制的小时数(01-12)</td></tr>
<tr><td class="left">j</td><td class="left">一年中的天数(01~366)</td></tr>
<tr><td class="left">m</td><td class="left">月份数(01~12)</td></tr>
<tr><td class="left">M</td><td class="left">分钟数(00~59)</td></tr>
<tr><td class="left">p</td><td class="left">(上午/下午)的标识(AM/PM)</td></tr>
<tr><td class="left">S</td><td class="left">秒数,包括最多两个润秒</td></tr>
<tr><td class="left">U</td><td class="left">周数(00~53),第一周从第一个星期天开始</td></tr>
<tr><td class="left">w</td><td class="left">每周中的天数(0~6),星期天为0</td></tr>
<tr><td class="left">W</td><td class="left">周数(00~53),第一周从第一个星期一开始</td></tr>
<tr><td class="left">x</td><td class="left">采用MM/DD/YY格式的日期</td></tr>
<tr><td class="left">X</td><td class="left">24小时制中HH/MM/SS格式的时间</td></tr>
<tr><td class="left">y</td><td class="left">当前世纪中的年数(00-99)</td></tr>
<tr><td class="left">Y</td><td class="left">年</td></tr>
<tr><td class="left">Z</td><td class="left">时区的缩写,如果系统不知道时区的话,就是空</td></tr>
</tbody>
</table>

</div>
</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> 容器</h2>
<div class="outline-text-2" id="text-5">


</div>

<div id="outline-container-5-1" class="outline-3">
<h3 id="sec-5-1"><span class="section-number-3">5.1</span> 如何使用一个由逗号分割开的数列来初始化一个容器</h3>
<div class="outline-text-3" id="text-5-1">

<p>   通过定义一个帮助类并重载逗号操作符,就可以在这些标准的容器中使用逗号初始化语法了.
</p>


<pre class="example">template&lt;class Seq_T&gt;
class comma_helper
{
public:
    typedef typename Seq_T::value_type value_type;
    explicit comma_helper(Seq_T&amp; x) :m(x){
    }
    comma_helper&amp; operator=(const value_type&amp; x){
        m.clear();
        m.push_back(x);
        return *this;
    }
    comma_helper&amp; operator+=(const value_type&amp; x){
        m.push_back(x);
        return *this;
    }

    template&lt;class Scalar_T&gt;
    comma_helper&amp; operator,(Scalar_T x){
        return operator+=(x);
    }
private:
    Seq_T&amp; m;
};

template&lt;typename Seq_T&gt;
comma_helper&lt;Seq_T&gt; initialize(Seq_T&amp; x)
{
    return comma_helper&lt;Seq_T&gt;(x);
}


int main(int argc,char** argv)
{
    vector&lt;int&gt; v;
    initialize(v) = 0,1,1,2,3,4,5;
    cout&lt;&lt;v[5]&lt;&lt;endl;
    return 0;
}
</pre>

</div>
</div>

</div>

<div id="outline-container-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> 算法</h2>
<div class="outline-text-2" id="text-6">


</div>

<div id="outline-container-6-1" class="outline-3">
<h3 id="sec-6-1"><span class="section-number-3">6.1</span> 如何随机打乱数据</h3>
<div class="outline-text-3" id="text-6-1">

<p>   使用&lt;algorithm&gt;中的random_shuffle标准算法带两个随机访问迭代器和一个可选的随机数产生函数,可以在一定范围内随机打乱这些数据
</p>
<p>   
   若要使用自己的随机数产生器,则它必须接收一个简单参数并返回一个简单值,且这两个值都可以转换成iterator_traits&lt;RndIter&gt;::difference_type类型
</p></div>

</div>

<div id="outline-container-6-2" class="outline-3">
<h3 id="sec-6-2"><span class="section-number-3">6.2</span> 如何在序列上进行集合运算</h3>
<div class="outline-text-3" id="text-6-2">

<p>   使用标准类库函数:set_union,set_difference,set_intersection和set_symmetric_difference
</p></div>

</div>

<div id="outline-container-6-3" class="outline-3">
<h3 id="sec-6-3"><span class="section-number-3">6.3</span> 如何将一个范围的元素输出到数据流中</h3>
<div class="outline-text-3" id="text-6-3">

<p>   使用copy算法和ostream_iterator算法把每一个元素都写到一个流中去.
</p></div>

</div>

<div id="outline-container-6-4" class="outline-3">
<h3 id="sec-6-4"><span class="section-number-3">6.4</span> 如何快速读取一系列数据存入容器中</h3>
<div class="outline-text-3" id="text-6-4">

<p>   使用istream_iterator即可
</p>


<pre class="example">istream_iterator&lt;stirng&gt; start(cin);
istream_iterator&lt;string&gt; end;
vector&lt;string&gt; vs(start,end)
</pre>

</div>
</div>

</div>

<div id="outline-container-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> 类</h2>
<div class="outline-text-2" id="text-7">


</div>

<div id="outline-container-7-1" class="outline-3">
<h3 id="sec-7-1"><span class="section-number-3">7.1</span> 类成员变量,需要在独立的源文件中初始化它,而不是在它所声明的头文件中.</h3>
<div class="outline-text-3" id="text-7-1">




<pre class="example">// static.h
class OneStatic
{
        static int count;
};
// static.cpp
int OneStatic::count = 0;
</pre>


<p>   
   若把初始化语句放到头文件,则每个包含了头文件的实现文件都会給这个变量分配存储空间,这样会得到链接错误.
</p></div>

</div>

<div id="outline-container-7-2" class="outline-3">
<h3 id="sec-7-2"><span class="section-number-3">7.2</span> 若在基类中提供了虚的析构函数,则你需要给它一个实现,这是因为子类的析构函数需要自动调用基类的析构函数</h3>
<div class="outline-text-3" id="text-7-2">

</div>

</div>

<div id="outline-container-7-3" class="outline-3">
<h3 id="sec-7-3"><span class="section-number-3">7.3</span> 如何调用超类中的虚函数</h3>
<div class="outline-text-3" id="text-7-3">

<p>   使用目标基类来修饰你的成员函数名
</p>


<pre class="example">DerivedPtr-&gt;Base::foo()
</pre>

</div>
</div>

</div>

<div id="outline-container-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> 异常安全</h2>
<div class="outline-text-2" id="text-8">


</div>

<div id="outline-container-8-1" class="outline-3">
<h3 id="sec-8-1"><span class="section-number-3">8.1</span> 保证初始化列表的异常安全</h3>
<div class="outline-text-3" id="text-8-1">

<p>   要捕获初始化列表中抛出的异常,需要使用try..catch的一种特殊用法
</p>


<pre class="example">class Broker
{
public:
        Broker(int devno1,int devno2)
        try:dev1_(Device(devno1)),
                    dev2_(Device(devno2)){}
        catch(...)
        {
                throw;          // 需要注意的是,这里无法访问dev1_和dev2_,因为这时候它们还不存在
        }
}
</pre>


<p>
   这里它把try代码块当成构造函数体.
</p></div>

</div>

<div id="outline-container-8-2" class="outline-3">
<h3 id="sec-8-2"><span class="section-number-3">8.2</span> 如何使类具有强异常安全保证</h3>
<div class="outline-text-3" id="text-8-2">

<p>   先做可能抛出异常的操作. 这些危险操作完成后,再更新对象状态.
</p></div>
</div>

</div>

<div id="outline-container-9" class="outline-2">
<h2 id="sec-9"><span class="section-number-2">9</span> 流</h2>
<div class="outline-text-2" id="text-9">


</div>

<div id="outline-container-9-1" class="outline-3">
<h3 id="sec-9-1"><span class="section-number-3">9.1</span> 如何实现自己的流操作符</h3>
<div class="outline-text-3" id="text-9-1">

<p>   有两类留操作符:带参数的和不带参数的.
</p>
<p>
   不带参数的流操作符容易实现. 只需要写一个以ios_base作为参数的函数. 在函数中对这个流做一些处理,然后再把这个流返回即可
</p>
<p>
   而带参数的流操作符,需要实现为一个类,该类以参数为构造函数的参数,并通过实现operator(ostream&amp; os)方法供流对象使用.
   此外,需要定义一个函数,该函数接收参数并返回上面定义的类对象.
   最后,还需要重载操作符&lt;&lt;,使得流对象直到 如何处理这个对象:
</p>


<pre class="example">class WidthSetter
{
public:
        WidthSetter(int n):width_(n){}
        void operator(osteram&amp; os) const {
                os.width(width_);
        }
private:
        int width_;
};


WidthSetter setWidth(int n){
        return WidthSetter(n);
}

ostream&amp; operator&lt;&lt;(ostream&amp; os, const WidthSetter&amp; ws){
        ws(os);
        return os;
}
</pre>

</div>

</div>

<div id="outline-container-9-2" class="outline-3">
<h3 id="sec-9-2"><span class="section-number-3">9.2</span> 如何删除/重命名文件</h3>
<div class="outline-text-3" id="text-9-2">

<p>   定义在&lt;cstdio&gt;中的标准C函数remove和rename可以完成这个任务
</p></div>

</div>

<div id="outline-container-9-3" class="outline-3">
<h3 id="sec-9-3"><span class="section-number-3">9.3</span> 如何创建一个临时文件名和文件</h3>
<div class="outline-text-3" id="text-9-3">

<p>   使用&lt;cstdio&gt;中的tmpfile或tmpname函数
</p></div>
</div>

</div>

<div id="outline-container-10" class="outline-2">
<h2 id="sec-10"><span class="section-number-2">10</span> 数字</h2>
<div class="outline-text-2" id="text-10">


</div>

<div id="outline-container-10-1" class="outline-3">
<h3 id="sec-10-1"><span class="section-number-3">10.1</span> 查找最大/最小值</h3>
<div class="outline-text-3" id="text-10-1">

<p>   使用&lt;algorithm&gt;中的函数max_element和min_element
</p></div>

</div>

<div id="outline-container-10-2" class="outline-3">
<h3 id="sec-10-2"><span class="section-number-3">10.2</span> 计算总和与平均值</h3>
<div class="outline-text-3" id="text-10-2">

<p>   使用&lt;numeric&gt;中的accumulate函数来计算总和,用distance函数来计算个数
</p>
<p>
   但该方法不能与istream_iterator一起工作
</p></div>

</div>

<div id="outline-container-10-3" class="outline-3">
<h3 id="sec-10-3"><span class="section-number-3">10.3</span> 过滤掉给定范围之外的值</h3>
<div class="outline-text-3" id="text-10-3">

<p>   使用定义在&lt;algorithm&gt;中的remove_copy_if函数
</p></div>

</div>

<div id="outline-container-10-4" class="outline-3">
<h3 id="sec-10-4"><span class="section-number-3">10.4</span> 生成随机数</h3>
<div class="outline-text-3" id="text-10-4">

<p>   &lt;cstdlib&gt;提供了一个C的运行函数rand来产生0到RAND_MAX之间的随机数
</p>
<p>
   使用rand函数前,还需要调用srand来給随机数产生器产生一个种子
</p></div>
</div>

</div>
