Programming/Cpp_Cookbook.org
** 硬编码Unicode字符串
   通过使用一个前置L来硬编码这个字符串,并且把这个字符像任何别的字符串一样输入,或者使用十六进制数字来代替这个unicode字符
   #+BEGIN_SRC c++
     string ws = L"Infinity:\u221E";
   #+END_SRC
   
   使用宽字符类型wchar_t可以用来存储Unicode字符. 这个类型的实现是预定义好的,常常使用UTF32编码
** 如何以遵循本地格式的方法读取/写入一个数字到流
   #+BEGIN_SRC c++
     int main(int argc,char** argv)
     {
         locale loc("");             // 创建一个本地的locale
         cout<<"Locale name is "<<loc.name()<<endl;
         cout.imbue(loc);            // 为流设置locale
         cout<<"pi in locale "<<cout.getloc().name()<<"is "<<3.14<<endl;
         return 0;
     }
   #+END_SRC

   除了cout.imbue(loc)设置某个流的locale外,还能通过Locale::global来设置全局的locale

   Locale的名字是非标准化的. 通常它们看上去是这样的:
   <language><country>.<codepage>
** 如何用本地的格式习惯来显示/读取时间和日期
   用use_facet来从locale中获取符合本地习惯的facet
   #+BEGIN_SRC c++
     const time_get<char>& dateReader = use_facet<time_get<char> >(cin.getLoc());
     const time_put<char>& dataWriter = use_facet<time_put<char> >(cout.getloc());
   #+END_SRC

   然后可以使用facet time_put定义的put函数来将"存储于tm对象中的日期信息"转化成一个字符序列,写至output迭代器.
   #+BEGIN_SRC c++
     ostreambuf_iterator osfitr = 
             dateWriter.put(out,             // output stream iterator
                            out,             // output stream
                            out.fill(),      // Fill char to use
                            &t,              // Addr of tm struct
                            &fmt[0],         // Begin of format string
                            &fmt[2]);        // end of format string
   #+END_SRC

   可以通过time_put::put返回一个ostreambuf_iterator迭代器,它有一个成员函数failed()来判断输出是否有问题.
   #+BEGIN_SRC c++
     if(osfitr.failed())
     {
             throw Exception("put time failed");
     }
   #+END_SRC
** 如何读取/写入符合本地格式的货币值
   类似读取/写入本地格式的时间,但是用money_put和money_get facet来替代time_put和time_get facet
** 如何对本地化字符串进行排序
   使用collate facet的compare函数可以对本地化字符串进行比较
   #+BEGIN_SRC c++
     bool localLessThan(const string& s1, const string& s2)
     {
             const collate<char> & col = use_facet<collate<char> >(locale());
             const char* pb1 = s1.data();
             const char* pb2 = s2.data();
             return (col.compare(pb1,pb1+s1.size(),
                                 pb2,pb2+s2.size()) < 0);
     }
   #+END_SRC

   compare函数与strcmp函数类似,当第一个字符串<第二个字符串时返回-1,相等时返回0,大于时返回1
* 指针
** 如何引用数据成员或成员函数的地址
   使用类名和范围操作符::加上*来引用类成员
   #+BEGIN_SRC c++
     MyClass::* mpi = &MyClass::ival_; // 指向成员变量,这里的值不是一个内存中的具体地址,可以把它想象成是一个从这个类对象的起始地址开始到这个数据成员之间的偏移量
     obj.*mpi = 5;                     // 給obj.ival赋值
     int* pi = obj.ival_;              // 也可以普通指针引用具体某个对象的成员变量
     
     void (MyClass::*mpf)();           // 指向成员函数的指针
     mpf = &MyClass::func;             // 指向成员函数
     (obj.*mpf)();                     // 调用obj的成员函数
     void(*pf)();                      // 定义一个普通函数指针
     pf = &obj.func();                 // 不能通过编译. 因为成员函数需要对象的上下文才有意义
   #+END_SRC
