Programming/Cpp_Cookbook.html

<div id="outline-container-11" class="outline-2">
<h2 id="sec-11"><span class="section-number-2">11</span> 国际化问题</h2>
<div class="outline-text-2" id="text-11">


</div>

<div id="outline-container-11-1" class="outline-3">
<h3 id="sec-11-1"><span class="section-number-3">11.1</span> 硬编码Unicode字符串</h3>
<div class="outline-text-3" id="text-11-1">

<p>   通过使用一个前置L来硬编码这个字符串,并且把这个字符像任何别的字符串一样输入,或者使用十六进制数字来代替这个unicode字符
</p>


<pre class="example">string ws = L"Infinity:\u221E";
</pre>


<p>   
   使用宽字符类型wchar_t可以用来存储Unicode字符. 这个类型的实现是预定义好的,常常使用UTF32编码
</p></div>

</div>

<div id="outline-container-11-2" class="outline-3">
<h3 id="sec-11-2"><span class="section-number-3">11.2</span> 如何以遵循本地格式的方法读取/写入一个数字到流</h3>
<div class="outline-text-3" id="text-11-2">




<pre class="example">int main(int argc,char** argv)
{
    locale loc("");             // 创建一个本地的locale
    cout&lt;&lt;"Locale name is "&lt;&lt;loc.name()&lt;&lt;endl;
    cout.imbue(loc);            // 为流设置locale
    cout&lt;&lt;"pi in locale "&lt;&lt;cout.getloc().name()&lt;&lt;"is "&lt;&lt;3.14&lt;&lt;endl;
    return 0;
}
</pre>


<p>
   除了cout.imbue(loc)设置某个流的locale外,还能通过Locale::global来设置全局的locale
</p>
<p>
   Locale的名字是非标准化的. 通常它们看上去是这样的:
   &lt;language&gt;&lt;country&gt;.&lt;codepage&gt;
</p></div>

</div>

<div id="outline-container-11-3" class="outline-3">
<h3 id="sec-11-3"><span class="section-number-3">11.3</span> 如何用本地的格式习惯来显示/读取时间和日期</h3>
<div class="outline-text-3" id="text-11-3">

<p>   用use_facet来从locale中获取符合本地习惯的facet
</p>


<pre class="example">const time_get&lt;char&gt;&amp; dateReader = use_facet&lt;time_get&lt;char&gt; &gt;(cin.getLoc());
const time_put&lt;char&gt;&amp; dataWriter = use_facet&lt;time_put&lt;char&gt; &gt;(cout.getloc());
</pre>


<p>
   然后可以使用facet time_put定义的put函数来将"存储于tm对象中的日期信息"转化成一个字符序列,写至output迭代器.
</p>


<pre class="example">ostreambuf_iterator osfitr = 
        dateWriter.put(out,             // output stream iterator
                       out,             // output stream
                       out.fill(),      // Fill char to use
                       &amp;t,              // Addr of tm struct
                       &amp;fmt[0],         // Begin of format string
                       &amp;fmt[2]);        // end of format string
</pre>


<p>
   可以通过time_put::put返回一个ostreambuf_iterator迭代器,它有一个成员函数failed()来判断输出是否有问题.
</p>


<pre class="example">if(osfitr.failed())
{
        throw Exception("put time failed");
}
</pre>

</div>

</div>

<div id="outline-container-11-4" class="outline-3">
<h3 id="sec-11-4"><span class="section-number-3">11.4</span> 如何读取/写入符合本地格式的货币值</h3>
<div class="outline-text-3" id="text-11-4">

<p>   类似读取/写入本地格式的时间,但是用money_put和money_get facet来替代time_put和time_get facet
</p></div>

</div>

<div id="outline-container-11-5" class="outline-3">
<h3 id="sec-11-5"><span class="section-number-3">11.5</span> 如何对本地化字符串进行排序</h3>
<div class="outline-text-3" id="text-11-5">

<p>   使用collate facet的compare函数可以对本地化字符串进行比较
</p>


<pre class="example">bool localLessThan(const string&amp; s1, const string&amp; s2)
{
        const collate&lt;char&gt; &amp; col = use_facet&lt;collate&lt;char&gt; &gt;(locale());
        const char* pb1 = s1.data();
        const char* pb2 = s2.data();
        return (col.compare(pb1,pb1+s1.size(),
                            pb2,pb2+s2.size()) &lt; 0);
}
</pre>


<p>
   compare函数与strcmp函数类似,当第一个字符串&lt;第二个字符串时返回-1,相等时返回0,大于时返回1
</p></div>
</div>

</div>

<div id="outline-container-12" class="outline-2">
<h2 id="sec-12"><span class="section-number-2">12</span> 指针</h2>
<div class="outline-text-2" id="text-12">


</div>

<div id="outline-container-12-1" class="outline-3">
<h3 id="sec-12-1"><span class="section-number-3">12.1</span> 如何引用数据成员或成员函数的地址</h3>
<div class="outline-text-3" id="text-12-1">

<p>   使用类名和范围操作符::加上*来引用类成员
</p>


<pre class="example">MyClass::* mpi = &amp;MyClass::ival_; // 指向成员变量,这里的值不是一个内存中的具体地址,可以把它想象成是一个从这个类对象的起始地址开始到这个数据成员之间的偏移量
obj.*mpi = 5;                     // 給obj.ival赋值
int* pi = obj.ival_;              // 也可以普通指针引用具体某个对象的成员变量

void (MyClass::*mpf)();           // 指向成员函数的指针
mpf = &amp;MyClass::func;             // 指向成员函数
(obj.*mpf)();                     // 调用obj的成员函数
void(*pf)();                      // 定义一个普通函数指针
pf = &amp;obj.func();                 // 不能通过编译. 因为成员函数需要对象的上下文才有意义
</pre>

</div>
</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2014-07-22T16:17+0800</p>
<p class="author">Author: DarkSun</p>
<p class="creator"><a href="http://orgmode.org">Org</a> version 7.9.3f with <a href="http://www.gnu.org/software/emacs/">Emacs</a> version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
